export interface Detail {
  id: number
  title: string
  header: string
  body: string
}

export const detailIndex: Detail[] = [
  {
    id: 1,
    title: 'บล็อกของฉัน',
    header: 'ยินดีต้อนรับสู่บล็อกของฉัน',
    body: `
    AdonisJS คืออะไร?
        AdonisJS คือเฟรมเวิร์กสำหรับการพัฒนาเว็บแอปพลิเคชันที่เขียนด้วยภาษา JavaScript โดยใช้ Node.js ซึ่งได้รับความนิยมจากนักพัฒนาเนื่องจากมีคุณสมบัติที่ทำให้การพัฒนาแอปพลิเคชันเป็นเรื่องง่ายและรวดเร็วกว่าเฟรมเวิร์กอื่นๆ เช่น Express.js หรือ Koa.js

        AdonisJS ถูกออกแบบมาให้มีโครงสร้างที่ชัดเจนและสอดคล้องกับการพัฒนาแอปพลิเคชันแบบ MVC (Model-View-Controller) ที่ช่วยให้การจัดการโค้ดสะดวกและเป็นระเบียบมากขึ้น นอกจากนี้ยังมาพร้อมกับเครื่องมือและฟีเจอร์สำคัญ เช่น ระบบ Authentication, ORM (Object Relational Mapping) สำหรับการเชื่อมต่อกับฐานข้อมูล, ระบบ Routing, Validation, และการจัดการ Middleware ที่ทำให้การพัฒนาเว็บแอปพลิเคชันมีประสิทธิภาพและสะดวกยิ่งขึ้น

        การใช้งาน AdonisJS จะช่วยให้นักพัฒนาสามารถสร้างแอปพลิเคชันที่มีความปลอดภัยสูงและสามารถขยายตัวได้อย่างง่ายดาย โดยไม่ต้องเสียเวลาในการตั้งค่าหรือสร้างฟังก์ชันพื้นฐานด้วยตัวเอง

        จุดเด่นของ AdonisJS:
            - มีการจัดการการเชื่อมต่อฐานข้อมูลที่ง่ายและสะดวก
            - รองรับการทำงานแบบ Asynchronous ด้วย Promises
            - มีระบบจัดการ Authentication ที่ช่วยให้การสร้างระบบล็อกอินและการยืนยันตัวตนทำได้ง่าย
            - สนับสนุนการใช้งาน WebSockets เพื่อสร้างแอปพลิเคชันแบบ Real-time
            - สะดวกในการใช้งานและมีเอกสารประกอบที่ดี

        AdonisJS จึงเป็นตัวเลือกที่น่าสนใจสำหรับนักพัฒนาที่ต้องการสร้างเว็บแอปพลิเคชันที่มีความซับซ้อนและต้องการความสามารถในการขยายตัวในอนาคต`,
  },
]
